import { ThemeColors } from "@nextui-org/theme";

export const COLORS: Partial<ThemeColors> = {
  foreground: "#b0e0b0",
  primary: {
    100: "#a0a04d", // светлый оттенок primary
    DEFAULT: "#303a30", // основной цвет primary по умолчанию
    900: "#606000", // темный оттенок primary
    foreground: "#b0e0b0", // текст
  },
  secondary: {
    100: "#e6d7c6", // светлый оттенок secondary
    DEFAULT: "#b0e0b0", // основной цвет secondary по умолчанию
    900: "#b39a82", // темный оттенок secondary
  },
  success: {
    100: "#4ade80", // светлый оттенок для успешных действий
    DEFAULT: "#10b981", // цвет для успешных действий по умолчанию
    900: "#059669", // темный оттенок для успешных действий
  },
  warning: {
    100: "#fbbf24", // светлый оттенок для предупреждений
    DEFAULT: "#f59e0b", // цвет для предупреждений по умолчанию
    900: "#d97706", // темный оттенок для предупреждений
  },
  danger: {
    100: "#f87171", // светлый оттенок для опасных действий
    DEFAULT: "#ef4444", // цвет для опасных действий по умолчанию
    900: "#dc2626", // темный оттенок для опасных действий
  },
};
